---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCData.GetHashCode
source: html/7b444d26-8d4b-d044-a891-1902eed89ac9.htm
---
# Autodesk.Revit.DB.IFC.IFCData.GetHashCode Method

Gets the hash code.

## Syntax (C#)
```csharp
public override int GetHashCode()
```